src/lib/ralph.py
# [[file:../ralph.org::+begin_src python][No heading:2]]
from typing import Annotated

import dagger
from dagger import DefaultPath, dag, function
